const data =[
	{
		image: '../static/images/certificate.jpg',
		title: 'הייעוד שלך בחיים',
		info: 'המון אנשים בארץ ובעולם לא יודעים מה הייעוד שלהם בחיים, מהי הסיבה שהם באו לעולם לעסוק ברפואה, מחשבים, פסיכולוגיה, ועוד... והמון אנשים מוצאים את עצמם קרועים בין מה שהם אוהבים לבין מה שהם עובדים, ולא בטוחים מהו המקצוע ומהו מקום וסוג העבודה המתאים להם, בעזרת מפת החיים שלכם, אני אוכל לראות את הייעוד שלכם בחיים ולכוון אתכם לדרך הכי טובה עבורכם.'
	},
	{
		image: '../static/images/baby.jpg',
		title: 'שם לתינוק',
		info: 'נולד לך תינוק / תינוקת? מ-ז-ל טוב!! מתלבטים בבחירת שם לתינוק? רוצים להעניק לילדכם שם שיוביל אותו לדרך קלה ומוצלחת בחייו? אני אעזור לך בבחירת שם לתינוק, שם שאתם אוהבים וגם יעשה לילדכם חיים טובים ומאושרים.'
	},
	{
		image: '../static/images/accounting-budget-calculate-3305.jpg',
		title: 'פרנסה',
		info: 'יש לכם בעיות בפרנסה? לא מוצאים מקום עבודה? מחליפים עבודות מהר? מחפשים שותף לעסקים? לא יודעים האם להיות שכירים או עצמאיים? אני אתן לך את כל הפתרונות לכל הדילמות שלכם ואכוון אתכם לדרך חדשה עם פרנסה טובה יותר.'
	},
	{
		image: '../static/images/affair-anniversary-asad-1024960.jpg',
		title: 'זוגיות',
		info: 'יש לכם בעיות בזוגיות? מתקשים למצוא אהבה? לא יודעים האם זה הזמן הנכון להתחתן? לא בטוחים האם זה הרגע הנכון לקנות דירה משותפת? אני אפתור לכם את כל הבעיות והדילמות הללו ואכוון אתכם לדרך בטוחה ומוצלחת.'
	},
	{
		image: '../static/images/clear-device-diet-53404.jpg',
		title: 'בריאות',
		info: 'יש לכם בעיות בריאות? אני אעשה לכם מפה נומרולגית ודרכה אראה את בעיות הבריאות המפריעות לכם בחיים. אני אתן לך את הדרכים הנכונות לפתור את הבעיות הללו'
	},
	{
		image: '../static/images/arrow-asphalt-bitumen-833317.jpg',
		title: 'ייעוץ והכוונה',
		info: 'אני אכוון אתכם לדרך חדשה וטובה יותר בחיים.'
	},
];


export default data;

